# coding: utf-8

#p %w(パトカー タクシー).map(&:chars).transpose.flatten.join
p %w(パトカー タクシー).map(&:chars).transpose.join

###---- memo ----###
# %w(パトカー タクシー) : 配列を作成
# => ["パトカー", "タクシー"]
#
# map(&:chars) : blockをcharに変換してblockの戻り値を集めた配列を作成
# => [["パ", "ト", "カ", "ー"], ["タ", "ク", "シ", "ー"]]
#
# transpose : 行と列を入れ替えた配列の配列を作成
# => [["パ", "タ"], ["ト", "ク"], ["カ", "シ"], ["ー", "ー"]]
#
# flatten : 配列の配列を平坦化した新しい配列を返す
# => ["パ", "タ", "ト", "ク", "カ", "シ", "ー", "ー"]
#
# join : 配列を結合(配列の中に配列が含まれるときは、平坦化して結合する)
# => "パタトクカシーー"
